---
kind: method
id: M:Autodesk.Revit.DB.ViewSchedule.GetValidCategoriesForSchedule
zh: 明细表
source: html/c84966d1-5dc5-86be-dd22-852aa32f1249.htm
---
# Autodesk.Revit.DB.ViewSchedule.GetValidCategoriesForSchedule Method

**中文**: 明细表

Gets a list of categories that can be used for a regular schedule.

## Syntax (C#)
```csharp
public static ICollection<ElementId> GetValidCategoriesForSchedule()
```

## Returns
The IDs of all valid categories.